Repository: Du4ert/edn-plugin
Catalog: locale/*/locale.po
Languages: ru

# plugins.pubIds.edn.displayName
source: EDN
ru: Модуль «EDN»

# plugins.pubIds.edn.description
source: This plugin enables the assignment of the Digital Object Identifiers to issues, articles and galleys in OJS.
ru: Включает присвоение идентификаторов цифровых объектов (EleLIBRARY Document Number) статьям в OJS.

# plugins.pubIds.edn.manager.settings.description
source: Please configure the EDN plugin to be able to manage and use EDNs in OJS:
ru: Пожалуйста, настройте модуль «EDN», чтобы иметь возможность использовать EDN в OJS и управлять ими:

# plugins.pubIds.edn.editor.edn.description
source: EDN must contain of only 6 lathin letters.
ru: EDN должен содержать только 6 латинских букв.

# plugins.pubIds.edn.editor.assigned
source: The EDN is assigned to this {$pubObjectType}.
ru: EDN присвоен {$pubObjectType}.

# plugins.pubIds.edn.editor.ednCustomIdentifierNotUnique
source: The given EDN is already in use for another published item. Please enter a unique EDN for each item.
ru: Заданный EDN уже используется для другого опубликованного элемента. Пожалуйста, введите уникальный EDN для каждого элемента.

# plugins.pubIds.edn.editor.ednCustomIdentifierDontMatchPreg
source: EDN must contain of only 6 lathin letters
ru: EDN должен состоять из 6 латинских букв, ничего больше

# plugins.pubIds.edn.editor.clearObjectsEdn
source: Clear
ru: Удалить

# plugins.pubIds.edn.editor.clearObjectsEdn.confirm
source: Are you sure you wish to delete the existing EDN?
ru: Вы уверены, что хотите удалить существующий EDN?

# plugins.pubIds.edn.editor.assignEdn
source: Assign the EDN {$pubId} to this {$pubObjectType}
ru: Присвоить EDN {$pubId} {$pubObjectType}

# plugins.pubIds.edn.editor.assignEdn.pattern
source: The EDN {$pubId} cannot be assigned because it contains an unresolved pattern.
ru: EDN {$pubId} не может быть присвоен, так как он содержит не замененный шаблон.

# plugins.pubIds.edn.editor.assignEdn.assigned
source: The EDN {$pubId} has been assigned.
ru: EDN {$pubId} был присвоен.

# plugins.pubIds.edn.editor.preview.publication
source: The EDN for this publication will be {$edn}.
ru: EDN для этой публикации будет {$edn}.

# plugins.pubIds.edn.editor.preview.publication.none
source: A EDN has not been assigned to this publication.
ru: EDN не был присвоен этой публикации.

# plugins.pubIds.edn.manager.settings.ednAssignJournalWide
source: Assign EDNs
ru: Присвоить EDN
